/*
 * ================================================
 * Auto-generated Offsets File
 * ================================================
 * Generated by: mommy ?? ??
 * Game: Solarland
 * Version: 4.25.3-1059089+++Singularity+v2.8
 * Generated at: 2025-12-03 20:20:36.051
 * Classes: 8140, Structs: 4966
 * Functions: 3136, Enums: 2431
 * ================================================
 */

#pragma once

// This file is auto-generated and intended for educational purposes only.
// It cannot be used in cheats or any unauthorized modifications.

#include <cstdint>

namespace Offsets
{
	class UObjectOffsets {
	public:
		static constexpr uintptr_t Flags = 0x8; // UObject::Flags
		static constexpr uintptr_t Index = 0xC; // UObject::Index
		static constexpr uintptr_t Class = 0x10; // UObject::Class
		static constexpr uintptr_t Outer = 0x20; // UObject::Outer
		static constexpr uintptr_t Name = 0x18; // UObject::Name
	};

	class UStructOffsets {
	public:
		static constexpr uintptr_t Children = 0x48; // UStruct::Children
		static constexpr uintptr_t SuperStruct = 0x40; // UStruct::SuperStruct
		static constexpr uintptr_t Size = 0x58; // UStruct::Size
		static constexpr uintptr_t MinAlignment = 0x5C; // UStruct::MinAlignment
		static constexpr uintptr_t ChildProperties = 0x50; // UStruct::ChildProperties
	};

	class UClassOffsets {
	public:
		static constexpr uintptr_t CastFlags = 0xD0; // UClass::CastFlags
		static constexpr uintptr_t ClassDefaultObject = 0x118; // UClass::ClassDefaultObject
		static constexpr uintptr_t ImplementedInterfaces = 0x1D8; // UClass::ImplementedInterfaces
	};

	class UFunctionOffsets {
	public:
		static constexpr uintptr_t FunctionFlags = 0xB0; // UFunction::FunctionFlags
		static constexpr uintptr_t ExecFunction = 0xD8; // UFunction::ExecFunction
	};

	class UEnumOffsets {
	public:
		static constexpr uintptr_t Names = 0x40; // UEnum::Names
	};

	class UFieldOffsets {
	public:
		static constexpr uintptr_t Next = 0x28; // UField::Next
	};

	class PropertyOffsets {
	public:
		static constexpr uintptr_t ElementSize = 0x3C; // Property::ElementSize
		static constexpr uintptr_t ArrayDim = 0x38; // Property::ArrayDim
		static constexpr uintptr_t Offset_Internal = 0x4C; // Property::Offset_Internal
		static constexpr uintptr_t PropertyFlags = 0x40; // Property::PropertyFlags
	};

	class FFieldOffsets {
	public:
		static constexpr uintptr_t Next = 0x20; // FField::Next
		static constexpr uintptr_t Class = 0x8; // FField::Class
		static constexpr uintptr_t Name = 0x28; // FField::Name
		static constexpr uintptr_t Flags = 0x30; // FField::Flags
	};

	class SpecialPropertyOffsets {
	public:
		static constexpr uintptr_t BoolProperty = 0x78; // BoolProperty::Base
		static constexpr uintptr_t EnumProperty = 0x78; // EnumProperty::Base
		static constexpr uintptr_t ObjectProperty = 0x78; // ObjectProperty::PropertyClass
		static constexpr uintptr_t ByteProperty = 0x78; // ByteProperty::Enum
		static constexpr uintptr_t StructProperty = 0x78; // StructProperty::Struct
		static constexpr uintptr_t DelegateProperty = 0x78; // DelegateProperty::SignatureFunction
		static constexpr uintptr_t ArrayProperty = 0x78; // ArrayProperty::Inner
		static constexpr uintptr_t SetProperty = 0x78; // SetProperty::ElementProp
		static constexpr uintptr_t MapProperty = 0x78; // MapProperty::Base
	};

	class ObjectArrayOffsets {
	public:
		static constexpr uintptr_t FUObjectItemSize = 0x18; // FUObjectArray::FUObjectItemSize
		static constexpr uintptr_t GObjects = 0xAD3A418; // FUObjectArray::GObjects
	};

	class NameArrayOffsets {
	public:
		static constexpr uintptr_t GNames = 0xAD21900; // FNamePool::GNames
		static constexpr uintptr_t AppendNameToString = 0x56545B0; // FName::AppendNameToString
	};

	class WorldOffsets {
	public:
		static constexpr uintptr_t GWorld = 0xAE9BBD0; // UWorld::GWorld
	};

	class EngineOffsets {
	public:
		static constexpr uintptr_t GEngine = 0xAE97790; // UEngine::GEngine
	};

	class ProcessEventOffsets {
	public:
		static constexpr uintptr_t PEOffset = 0x5761AF0; // ProcessEvent::PEOffset
		static constexpr uintptr_t PEIndex = 0x43; // ProcessEvent::PEIndex
	};

	class TextOffsets {
	public:
		static constexpr uintptr_t TextSize = 0x18; // sizeof(FText)
		static constexpr uintptr_t TextDatOffset = 0x0; // FText::TextData
		static constexpr uintptr_t InTextDataStringOffset = 0x28; // FTextData::Text
	};

	class InSDKOffsets {
	public:
		static constexpr uintptr_t PersistentLevel = 0x30; // UWorld::PersistentLevel
		static constexpr uintptr_t GameState = 0x1A0; // UWorld::GameState
		static constexpr uintptr_t OwningGameInstance = 0x1F8; // UWorld::OwningGameInstance
		static constexpr uintptr_t NetDriver = 0x38; // UWorld::NetDriver
		static constexpr uintptr_t GameMode = 0x198; // UWorld::GameMode
		static constexpr uintptr_t bIsTearingDown = 0xFFFFFFFF; // UWorld::bIsTearingDown
		static constexpr uintptr_t TimeSeconds = 0xFFFFFFFF; // UWorld::TimeSeconds
		static constexpr uintptr_t RealTimeSeconds = 0xFFFFFFFF; // UWorld::RealTimeSeconds
		static constexpr uintptr_t DeltaTimeSeconds = 0xFFFFFFFF; // UWorld::DeltaTimeSeconds
		static constexpr uintptr_t Levels = 0x0; // UWorld::Levels
		static constexpr uintptr_t LocalPlayers = 0x38; // UGameInstance::LocalPlayers
		static constexpr uintptr_t Actors = 0x98; // ULevel::Actors
		static constexpr uintptr_t OwningWorld = 0xB8; // ULevel::OwningWorld
		static constexpr uintptr_t RootComponent = 0x1B0; // AActor::RootComponent
		static constexpr uintptr_t PlayerCameraManager = 0x390; // APlayerController::PlayerCameraManager
		static constexpr uintptr_t AcknowledgedPawn = 0x378; // APlayerController::AcknowledgedPawn
		static constexpr uintptr_t GameViewport = 0xFFFFFFFF; // UGameEngine::GameViewport
		static constexpr uintptr_t World = 0x78; // UGameViewportClient::World
		static constexpr uintptr_t RowMap = 0x30; // UDataTable::RowMap
		static constexpr uintptr_t PropertySize = 0x78; // Properties::PropertySize
	};

	/*
	struct FMinimalViewInfo
	{
		Vector3 Location; // 0x0
		Vector3 Rotation; // 0xC
		char pad_after_rotation[0x68];
		float FOV; // 0x80
		float DesiredFOV; // 0x84
		float OrthoWidth; // 0x8C
		float OrthoNearClipPlane; // 0x90
		float OrthoFarClipPlane; // 0x94
		float AspectRatio; // 0x98
	};
	*/

	/*
	struct CameraCacheEntry
	{
		float TimeStamp; // 0x0
		char chunks[0xC]; // padding
		FMinimalViewInfo POV; // 0x10
	};
	*/

	// ================================================
	// End of Generated Offsets
	// ================================================
}

