/*
 * ================================================
 * Auto-generated Offsets File
 * ================================================
 * Generated by: mommy ?? ??
 * Game: DeadByDaylight
 * Version: 5.4.4-2966730+++DeadByDaylight+Omelet_HF2
 * Generated at: 2025-12-23 15:12:21.415
 * Classes: 10693, Structs: 6237
 * Functions: 3909, Enums: 2413
 * ================================================
 */

#pragma once

// This file is auto-generated and intended for educational purposes only.
// It cannot be used in cheats or any unauthorized modifications.

#include <cstdint>

namespace Offsets
{
	class UObjectOffsets {
	public:
		static constexpr uintptr_t Flags = 0x8; // UObject::Flags
		static constexpr uintptr_t Index = 0xC; // UObject::Index
		static constexpr uintptr_t Class = 0x10; // UObject::Class
		static constexpr uintptr_t Outer = 0x28; // UObject::Outer
		static constexpr uintptr_t Name = 0x18; // UObject::Name
	};

	class UStructOffsets {
	public:
		static constexpr uintptr_t Children = 0x50; // UStruct::Children
		static constexpr uintptr_t SuperStruct = 0x48; // UStruct::SuperStruct
		static constexpr uintptr_t Size = 0x60; // UStruct::Size
		static constexpr uintptr_t MinAlignment = 0x144; // UStruct::MinAlignment
		static constexpr uintptr_t ChildProperties = 0x58; // UStruct::ChildProperties
	};

	class UClassOffsets {
	public:
		static constexpr uintptr_t CastFlags = 0xE0; // UClass::CastFlags
		static constexpr uintptr_t ClassDefaultObject = 0x120; // UClass::ClassDefaultObject
		static constexpr uintptr_t ImplementedInterfaces = 0x1E8; // UClass::ImplementedInterfaces
	};

	class UFunctionOffsets {
	public:
		static constexpr uintptr_t FunctionFlags = 0xB8; // UFunction::FunctionFlags
		static constexpr uintptr_t ExecFunction = 0xE0; // UFunction::ExecFunction
	};

	class UEnumOffsets {
	public:
		static constexpr uintptr_t Names = 0x48; // UEnum::Names
	};

	class UFieldOffsets {
	public:
		static constexpr uintptr_t Next = 0x30; // UField::Next
	};

	class PropertyOffsets {
	public:
		static constexpr uintptr_t ElementSize = 0x34; // Property::ElementSize
		static constexpr uintptr_t ArrayDim = 0x30; // Property::ArrayDim
		static constexpr uintptr_t Offset_Internal = 0x44; // Property::Offset_Internal
		static constexpr uintptr_t PropertyFlags = 0x38; // Property::PropertyFlags
	};

	class FFieldOffsets {
	public:
		static constexpr uintptr_t Next = 0x18; // FField::Next
		static constexpr uintptr_t Class = 0x8; // FField::Class
		static constexpr uintptr_t Name = 0x20; // FField::Name
		static constexpr uintptr_t Flags = 0x2C; // FField::Flags
	};

	class SpecialPropertyOffsets {
	public:
		static constexpr uintptr_t BoolProperty = 0x78; // BoolProperty::Base
		static constexpr uintptr_t EnumProperty = 0x78; // EnumProperty::Base
		static constexpr uintptr_t ObjectProperty = 0x78; // ObjectProperty::PropertyClass
		static constexpr uintptr_t ByteProperty = 0x78; // ByteProperty::Enum
		static constexpr uintptr_t StructProperty = 0x78; // StructProperty::Struct
		static constexpr uintptr_t DelegateProperty = 0x78; // DelegateProperty::SignatureFunction
		static constexpr uintptr_t ArrayProperty = 0x80; // ArrayProperty::Inner
		static constexpr uintptr_t SetProperty = 0x78; // SetProperty::ElementProp
		static constexpr uintptr_t MapProperty = 0x78; // MapProperty::Base
	};

	class ObjectArrayOffsets {
	public:
		static constexpr uintptr_t FUObjectItemSize = 0x18; // FUObjectArray::FUObjectItemSize
		static constexpr uintptr_t GObjects = 0xB7E7E80; // FUObjectArray::GObjects
	};

	class NameArrayOffsets {
	public:
		static constexpr uintptr_t GNames = 0xB6B0378; // FNamePool::GNames
		static constexpr uintptr_t AppendNameToString = 0x153E250; // FName::AppendNameToString
	};

	class WorldOffsets {
	public:
		static constexpr uintptr_t GWorld = 0xB9A0D10; // UWorld::GWorld
	};

	class EngineOffsets {
	public:
		static constexpr uintptr_t GEngine = 0xB99D550; // UEngine::GEngine
	};

	class ProcessEventOffsets {
	public:
		static constexpr uintptr_t PEOffset = 0x1752770; // ProcessEvent::PEOffset
		static constexpr uintptr_t PEIndex = 0x4D; // ProcessEvent::PEIndex
	};

	class TextOffsets {
	public:
		static constexpr uintptr_t TextSize = 0x10; // sizeof(FText)
		static constexpr uintptr_t TextDatOffset = 0x0; // FText::TextData
		static constexpr uintptr_t InTextDataStringOffset = 0x28; // FTextData::Text
	};

	class InSDKOffsets {
	public:
		static constexpr uintptr_t PersistentLevel = 0x38; // UWorld::PersistentLevel
		static constexpr uintptr_t GameState = 0x170; // UWorld::GameState
		static constexpr uintptr_t OwningGameInstance = 0x1E8; // UWorld::OwningGameInstance
		static constexpr uintptr_t NetDriver = 0x40; // UWorld::NetDriver
		static constexpr uintptr_t GameMode = 0x168; // UWorld::GameMode
		static constexpr uintptr_t Levels = 0x0; // UWorld::Levels
		static constexpr uintptr_t LocalPlayers = 0x40; // UGameInstance::LocalPlayers
		static constexpr uintptr_t Actors = 0xA8; // ULevel::Actors
		static constexpr uintptr_t OwningWorld = 0xC8; // ULevel::OwningWorld
		static constexpr uintptr_t RootComponent = 0x1B0; // AActor::RootComponent
		static constexpr uintptr_t Instigator = 0x198; // AActor::Instigator
		static constexpr uintptr_t PlayerCameraManager = 0x370; // APlayerController::PlayerCameraManager
		static constexpr uintptr_t AcknowledgedPawn = 0x360; // APlayerController::AcknowledgedPawn
		static constexpr uintptr_t World = 0x80; // UGameViewportClient::World
		static constexpr uintptr_t RowMap = 0x38; // UDataTable::RowMap
		static constexpr uintptr_t PropertySize = 0x78; // Properties::PropertySize
	};

	/*
	struct FMinimalViewInfo
	{
		Vector3 Location; // 0x0
		Vector3 Rotation; // 0x18
		float FOV; // 0x30
		float DesiredFOV; // 0x34
		float OrthoWidth; // 0x38
		float OrthoNearClipPlane; // 0x48
		float OrthoFarClipPlane; // 0x4C
		float AspectRatio; // 0x54
	};
	*/

	/*
	struct CameraCacheEntry
	{
		float TimeStamp; // 0x0
		char chunks[0xC]; // padding
		FMinimalViewInfo POV; // 0x10
	};
	*/

	// ================================================
	// End of Generated Offsets
	// ================================================
}

